Revit 2026 API

# CompoundStructureMinimumSampleHeight Property

---

The minimum sample height determined by the current sample height and the horizontal segments.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double MinimumSampleHeight { get; }
```
```vb
Public ReadOnly Property MinimumSampleHeight As Double
	Get
```
```cpp
public:
property double MinimumSampleHeight {
	double get ();
}
```
```fsharp
member MinimumSampleHeight : float with get
```

#### Property Value

Double

All horizontal segments dimensioned to the top must remain strictly above all horizontal segments dimensioned to the bottom.

#### Reference

CompoundStructure Class

Autodesk.Revit.DB Namespace